// https://www.acmicpc.net/problem/15824
// 너 봄에는 캡사이신이 맛있단다

// 문제
// 주헌이는 매운맛을 좋아한다. 정확히는, 매운맛을 먹음으로써 느낄 수 있는 고통에서 희열을 느끼는 진정한 '즐기는 자'다.
// '스코빌 지수'란 고추류가 가진 매운맛의 원인인 캡사이신의 농도를 수치화 한 단위이다.
// 주헌이가 느끼는 매운 정도는 굉장히 독특한데, 먹고 있는 메뉴의 절대 수치가 아닌 음식과의 상대수치에 기반한다.
// 예를 들어 [5, 2, 8]의 스코빌 지수를 가진 음식을 먹을 때 주헌이가 느끼는 매운 정도는
// 가장 높은 수치인 8과 가장 낮은 수치인 2의 차이인 6만큼의 매운맛을 느낀다.
// 이처럼 메뉴들의 스코빌 지수가 있을 때 그 최댓값과 최솟값의 차이를 "주헌고통지수"라고 정의한다.
// 최근 주헌이에게 좋아하는 매운맛 전문점이 생겼다.
// 메뉴가 아주 다양한 이 음식점은 모든 메뉴의 스코빌 지수를 명시한 메뉴판을 제공한다.
// 주헌이의 목표는 이 음식점의 모든 음식 조합을 먹어보는 것이다. 하지만 주헌이는 까다로워서 한 번 먹어본 조합은 다시 먹지 않는다.
// 이 음식점의 모든 조합을 먹어 볼 때 주헌이가 즐길 수 있는 주헌고통지수의 합을 구해보자.

// 입력
// 첫 줄에 메뉴의 총 개수 N이 주어진다. 두 번째 줄에는 N개의 메뉴의 스코빌 지수가 주어진다. 모든 스코빌 지수는 0보다 크거나 같고 231-1보다 작거나 같은 정수이다.

// 출력
// 한 줄에 모든 조합의 주헌고통지수 합을 1,000,000,007로 나눈 나머지를 출력한다.

// 예제 입력 1 
// 3
// 5 2 8
// 예제 출력 1 
// 18
// 예제 입력 2 
// 6
// 1 4 5 5 6 10
// 예제 출력 2 
// 307

#include <iostream>
#include <algorithm>
#include <vector>
using namespace std;

int main() {
ios_base::sync_with_stdio(false);
cin.tie(NULL);
////////////////////////////////////////////
int nOfnums; cin >> nOfnums;
vector<long long> nums(nOfnums);
for (int n = 0; n < nOfnums; n++) cin >> nums[n];
sort(nums.begin(), nums.end());
vector<long long> sums(nOfnums);
sums[0] = nums[0];
for (int i = 1; i < nOfnums; i++) sums[i] = sums[i-1] + nums[i];
long long res = 0;
for (int n = 0; n < nOfnums-1; n++) {
    res = res*2;
    res += sums[nOfnums-1]-sums[nOfnums-2-n]-sums[n];
    res = res % 1000000007;
}
cout << res;
////////////////////////////////////////////
}